#+PROPERTY: header-args:javascript :tangle artifacts/ttauta3.js :mkdirp yes
#+PROPERTY: header-args:html :tangle artifacts/ttauta3.html :mkdirp yes
#+PROPERTY: header-args:dot :tangle artifacts/ttauta3.dot :mkdirp yes

* Generation of supports 

  #+begin_src python :results output 
    import itertools
    vertices = [1,2,3,4]
    edges = {"a":(1,2), "b":(2,3), "c":(3,4), "d":(4,1), "x": (1,3), "y": (2,4)}

    for s in itertools.combinations(edges.keys(),4):
	 if not (("x" in s and "y" in s) and ("x"in s or "y" in s)):
	      print ''.join(sorted(tuple(s)))
  #+end_src

  #+RESULTS:
  : abcd
  : abcy
  : abcx
  : acdy
  : acdx
  : abdy
  : abdx
  : bcdy
  : bcdx


